<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PagesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('pages')->insert([
            'page_name' => 'about-us',
            'content' =>' هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق',
            'title' => 'من نحن',
            'photos' => null,
        ]);

        DB::table('pages')->insert([
            'page_name' => 'about-us',
            'content' =>' هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق',
            'title' => 'من نحن',
            'photos' => null,
        ]);

        DB::table('pages')->insert([
            'page_name' => 'about-us',
            'content' =>' هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق',
            'title' => 'من نحن',
            'photos' => null,
        ]);

        DB::table('pages')->insert([
            'page_name' => 'site-treaty',
            'content' =>' هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق',
            'title' => 'معاهدة الموقع',
            'photos' => null,
        ]);

        DB::table('pages')->insert([
            'page_name' => 'site-treaty',
            'content' =>' هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق',
            'title' => 'معاهدة الموقع',
            'photos' => null,
        ]);

        DB::table('pages')->insert([
            'page_name' => 'site-treaty',
            'content' =>' هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق',
            'title' => 'معاهدة الموقع',
            'photos' => null,
        ]);

        DB::table('pages')->insert([
            'page_name' => 'terms-conditions',
            'content' =>' هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق',
            'title' => 'الاحكام و الشروط',
            'photos' => null,
        ]);

        DB::table('pages')->insert([
            'page_name' => 'terms-conditions',
            'content' =>' هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق',
            'title' => 'الاحكام و الشروط',
            'photos' => null,
        ]);

        DB::table('pages')->insert([
            'page_name' => 'terms-conditions',
            'content' =>' هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق',
            'title' => 'الاحكام و الشروط',
            'photos' => null,
        ]);


        DB::table('pages')->insert([
            'page_name' => 'amrtidall',
            'content' =>' هو برنامج ولاء لشركاء النجاح مقدم من ديل .يمكنك الاشتراك في برنامج اّمر',
            'title' => 'امر تدلل',
            'photos' => null,
        ]);
    }
}
